Lab_sessions/lab_05.org
#+options: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline
#+options: author:t broken-links:nil c:nil creator:nil
#+options: d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t num:nil
#+options: p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t
#+options: timestamp:t title:t toc:t todo:t |:t
#+title: R modelling. Lab session 05
#+date:
#+author: Daniel Ballesteros Chávez.
#+email: daniel@linuxdeb.home
#+language: en
#+select_tags: export
#+exclude_tags: noexport
#+creator: Emacs 27.1 (Org mode 9.3.6)
# +OPTIONS: html-style:nil

# Daniel Ballesteros-Chávez

#+HTML_HEAD: <style type="text/css"> tr:nth-child(odd) {background-color: #e2e2e2;}  tr:first-child {font-weight: bold}  tr:hover {background-color: #d0c6e5;}</style>
#+HTML_HEAD: <style> pre.src { overflow: auto; }</style>
#+HTML_HEAD: <style> .mmbox {background-color: #BFF2FF; padding: 10px 20px 10px 20px; }</style>
#+HTML_HEAD_EXTRA: <style>code {background-color: #ccc}</style>

:results:
#+HTML_HEAD:<style> /* Daniel Ballesteros-Chavez */
#+HTML_HEAD:
#+HTML_HEAD: :root {
#+HTML_HEAD:   --col0: #2b2d42;		/*Top bar*/
#+HTML_HEAD:   --col1: #8d99ae;		/* Section header bg*/
#+HTML_HEAD:   --col2: #edf2f4;		/*body bg*/
#+HTML_HEAD:   --col3: #ef233c;		/*Active top bar*/
#+HTML_HEAD:   --col4: #d90429;		/*Home botton bg*/
#+HTML_HEAD:   --col5: #173f5f;			/*H2 header*/
#+HTML_HEAD:
#+HTML_HEAD: }
#+HTML_HEAD:
#+HTML_HEAD: body {
#+HTML_HEAD:     /*    background-image: url('./Images/bgpic.jpg'); */
#+HTML_HEAD:     background-size: cover;
#+HTML_HEAD:     background-attachment: fixed;
#+HTML_HEAD:	font-family: Helvetica;
#+HTML_HEAD:     /* background-position: left top; */
#+HTML_HEAD:     /* background-repeat: no-repeat; */
#+HTML_HEAD:     background: var(--col2);
#+HTML_HEAD:     margin: 20px auto; /* "auto" for centering */
#+HTML_HEAD:     max-width: 768px;
#+HTML_HEAD:     /* max-width: 800px; */
#+HTML_HEAD:     /* font-family: monospace; */
#+HTML_HEAD: }
#+HTML_HEAD:
#+HTML_HEAD: h1 {
#+HTML_HEAD:     display: block;
#+HTML_HEAD:     font-size: 1.5em;
#+HTML_HEAD:     /* margin-top: 0.67em; */
#+HTML_HEAD:     /* margin-bottom: 0.67em; */
#+HTML_HEAD:     margin-left: 0;
#+HTML_HEAD:     margin-right: 0;
#+HTML_HEAD:     font-weight: bold;
#+HTML_HEAD:     color: var(--col0);
#+HTML_HEAD:     padding: 5px 20px;
#+HTML_HEAD:     /*    background-color:#092B39;*/
#+HTML_HEAD:     /*text-align: center; */
#+HTML_HEAD:     /*text-shadow: 3px 2px gray;*/
#+HTML_HEAD: }
#+HTML_HEAD:
#+HTML_HEAD: h2 {
#+HTML_HEAD:     display: block;
#+HTML_HEAD:     font-size: 1em;
#+HTML_HEAD:     margin-top: 0.67em;
#+HTML_HEAD:     margin-bottom: 0.67em;
#+HTML_HEAD:     margin-left: 0;
#+HTML_HEAD:     margin-right: 0;
#+HTML_HEAD:     font-weight: bold;
#+HTML_HEAD:     color: var(--col0);
#+HTML_HEAD:     background-color: var(--col1);
#+HTML_HEAD:     border-radius: 10px 10px;
#+HTML_HEAD:     padding: 10px 20px;
#+HTML_HEAD:     /*    background-color:#092B39;*/
#+HTML_HEAD: }
#+HTML_HEAD:
#+HTML_HEAD: div.outline-2 {
#+HTML_HEAD:     background-color: var(--col2);
#+HTML_HEAD:     /* border:3px solid #f2f6f9; */
#+HTML_HEAD:     color: var(--col0);
#+HTML_HEAD: }
#+HTML_HEAD:
#+HTML_HEAD: div.outline-2 h2 {
#+HTML_HEAD:     color: var(--col5);
#+HTML_HEAD:     font-size: 20px; /* arial, sans-serif; */
#+HTML_HEAD:     /* font-family: 'Fredoka One', cursive; */
#+HTML_HEAD: }
#+HTML_HEAD:
#+HTML_HEAD:
#+HTML_HEAD: div.outline-text-2 {
#+HTML_HEAD: }
#+HTML_HEAD:
#+HTML_HEAD: div.outline-text-2 p {
#+HTML_HEAD:     text-align: justify;
#+HTML_HEAD: }
#+HTML_HEAD:
#+HTML_HEAD: </style>
:end:

* Introduction




* Practice 1

Suppose we have collected the following information

#+begin_src R :session :results none :exports code
AA <- c(
33.62 ,37.80, 24.31, 34.97, 21.81, 27.36, 12.45, 34.20, 39.60, 39.47, 29.14, 38.11,
42.26 , 6.86, 36.64, 55.42, 22.37, 15.66, 31.29, 30.81, 34.53, 28.56, 26.69, 40.48,
22.34 ,33.56, 22.60, 18.48, 32.01, 33.22, 14.13, 24.02, 33.88, 32.07, 17.94, 28.51,
29.11 ,41.72, 51.78, 38.59, 31.11, 31.30, 27.04, 28.37, 24.88, 39.63, 18.73, 34.48,
29.73 ,11.47, 24.58, 28.14, 32.43, 10.85, 44.03, 26.83, 24.30, 19.60, 20.57, 40.13,
37.04 ,31.42, 34.40, 35.09, 32.87, 32.78, 31.24, 19.80, 10.14, 35.69, 24.07, 23.12,
35.25 ,26.85, 28.42, 26.53, 12.67, 23.82, 19.45, 22.21, 31.03, 44.85, 16.91, 41.76,
27.94 ,22.51, 23.44, 35.41, 30.00, 47.13, 22.98, 38.17, 14.74, 40.43, 27.96, 26.06,
26.35 ,33.74, 21.79, 35.61)
#+end_src


Use the estimator for the mean $\mu$ given by
\begin{equation}
\hat{Y} = \frac{1}{n}\sum_{i=1}^{n} X_{i}.
\end{equation}

If we knew that the standard deviation of this parameter on the population is $\sigma=3$
compute a 95% Confidence interval (C.I) for $\mu$, assuming the data is normally distributed:

\begin{equation}
\left[ \hat{Y} - z_{\frac{\alpha}{2}}\frac{\sigma}{\sqrt{n}} , \hat{Y} + z_{\frac{\alpha}{2}}\frac{\sigma}{\sqrt{n}} \right]
\end{equation}





* Practice 2

Task 3

A) When the sample is small, it is more convenient to assume that the
data follows a *Student t* distribution. Use ~?dt~ and plot the
probability density function for different degrees of freedom: df=1,
df=3, df=9, df=100. (Hint: you can plot dt(x) on $-5 \leq x \leq 5$).
+ Add the four graphs in the same plot
+ Use different line types and different color for each graph.
+ Add a tile: "Student t distribution"
+ Add a legend specifying the degrees of freedom for each plot.
+ Change the background color (see ~?par~)


B) Take a sample of size n=10 without replacement (see ~?sample~ from
the data in Task 1. For this sample, compute the 90% CI using the
function ~t.test~. Show the sample you are using and discuss the
results obtained.




* Practice 3

This is an illutstratoin of the central limit theorem.

A) Generate a vector of length 10000, with real numbers between $0$ to $10$
uniformly distributed, and Plot a (frequency) histogram.

B) Take a sample of size $n=5$ of your vector and compute the artihmetic mean (average), store the result in 
another variable. Repeat the experiment 3000 times and make a histogram of the means obtained.

C) Is this in accordnce with the Central Limit Theorem?





* Practice 4

The ancient game of craps consists on throwing two dice and add the
scores together. There are 11 possible scores from a minimum of 2 to a
maximum of 12. The most likely score is 7 because there are six ways
that this could come about.

A) Create Two vectors (A and B) of length 10000 with numbers $1,2,3,4,5,6$
choosen randomly each one simulating the results of throwing a dice
ten thousand times. (Hint. This can be done modifying ~runif~ or with
the function ~sample~)

B) Plot the histogram of one dice. Plot the histogram of the sum of who
dice $A + B$. Comment the results obtained.

C) What is the most likely value in the crab game with 4 dice?



* Practice 5

Recall that The Binomial distribution computes the probabilities of
events where only two possible outcomes can occur (success or
failure). Suppose then that $X \sim \mbox{Binom}(n,p)$ then
if $f$ denotes the probaility density function we can write:

\begin{equation}
f(k) = P(X = k) = \binom{n}{k}  p^{k}(1-p)^{n-k}.
\end{equation}

This reads as follows: The probaility of obtaining (exactly) $k$ successful 
events out of $n$ trials each of them of probability $p$ is $f(k)$.

A) Let fix the value $p = 0.15$. Make a gird (2x2) plot (see ~par~ and
~mfrow~) of the binomial density function for $n = 5$,  $n = 10$, $n = 20$ and
$n=300$. (Hint. For descrete distrubutions, the plot looks nicer with
the option ~type = "h"~)

B) Plot the distribution for  $X \sim \mbox{Binom}(300, 0.15)$ and
$Z \sim N(\mu, \sigma^2)$ (in the same plot window) where
\begin{equation}
\mu = E(X) , \qquad \sigma^2 = \mbox{Var}(X)
\end{equation}



