Lab_sessions/lab_05.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-11-12 Sat 17:02 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>R modelling. Lab session 05</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Daniel Ballesteros Chávez." />
</head>
<body>
<div id="content">
<h1 class="title">R modelling. Lab session 05</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org67bce80">Introduction</a></li>
<li><a href="#orgbe32dd1">Practice 1</a></li>
<li><a href="#org2f16901">Practice 2</a></li>
<li><a href="#org31205e9">Practice 3</a></li>
<li><a href="#org10f6adc">Practice 4</a></li>
<li><a href="#org65b5e16">Practice 5</a></li>
</ul>
</div>
</div>

<div id="outline-container-org67bce80" class="outline-2">
<h2 id="org67bce80">Introduction</h2>
</div>




<div id="outline-container-orgbe32dd1" class="outline-2">
<h2 id="orgbe32dd1">Practice 1</h2>
<div class="outline-text-2" id="text-orgbe32dd1">
<p>
Suppose we have collected the following information
</p>

<div class="org-src-container">
<pre class="src src-R">AA <span style="color: #a2cd5a;">&lt;-</span> c(
33.62 ,37.80, 24.31, 34.97, 21.81, 27.36, 12.45, 34.20, 39.60, 39.47, 29.14, 38.11,
42.26 , 6.86, 36.64, 55.42, 22.37, 15.66, 31.29, 30.81, 34.53, 28.56, 26.69, 40.48,
22.34 ,33.56, 22.60, 18.48, 32.01, 33.22, 14.13, 24.02, 33.88, 32.07, 17.94, 28.51,
29.11 ,41.72, 51.78, 38.59, 31.11, 31.30, 27.04, 28.37, 24.88, 39.63, 18.73, 34.48,
29.73 ,11.47, 24.58, 28.14, 32.43, 10.85, 44.03, 26.83, 24.30, 19.60, 20.57, 40.13,
37.04 ,31.42, 34.40, 35.09, 32.87, 32.78, 31.24, 19.80, 10.14, 35.69, 24.07, 23.12,
35.25 ,26.85, 28.42, 26.53, 12.67, 23.82, 19.45, 22.21, 31.03, 44.85, 16.91, 41.76,
27.94 ,22.51, 23.44, 35.41, 30.00, 47.13, 22.98, 38.17, 14.74, 40.43, 27.96, 26.06,
26.35 ,33.74, 21.79, 35.61)
</pre>
</div>


<p>
Use the estimator for the mean \(\mu\) given by
</p>
\begin{equation}
\hat{Y} = \frac{1}{n}\sum_{i=1}^{n} X_{i}.
\end{equation}

<p>
If we knew that the standard deviation of this parameter on the population is \(\sigma=3\)
compute a 95% Confidence interval (C.I) for \(\mu\), assuming the data is normally distributed:
</p>

\begin{equation}
\left[ \hat{Y} - z_{\frac{\alpha}{2}}\frac{\sigma}{\sqrt{n}} , \hat{Y} + z_{\frac{\alpha}{2}}\frac{\sigma}{\sqrt{n}} \right]
\end{equation}
</div>
</div>





<div id="outline-container-org2f16901" class="outline-2">
<h2 id="org2f16901">Practice 2</h2>
<div class="outline-text-2" id="text-org2f16901">
<p>
Task 3
</p>

<p>
A) When the sample is small, it is more convenient to assume that the
data follows a <b>Student t</b> distribution. Use <code>?dt</code> and plot the
probability density function for different degrees of freedom: df=1,
df=3, df=9, df=100. (Hint: you can plot dt(x) on \(-5 \leq x \leq 5\)).
</p>
<ul class="org-ul">
<li>Add the four graphs in the same plot</li>
<li>Use different line types and different color for each graph.</li>
<li>Add a tile: "Student t distribution"</li>
<li>Add a legend specifying the degrees of freedom for each plot.</li>
<li>Change the background color (see <code>?par</code>)</li>
</ul>


<p>
B) Take a sample of size n=10 without replacement (see <code>?sample</code> from
the data in Task 1. For this sample, compute the 90% CI using the
function <code>t.test</code>. Show the sample you are using and discuss the
results obtained.
</p>
</div>
</div>




<div id="outline-container-org31205e9" class="outline-2">
<h2 id="org31205e9">Practice 3</h2>
<div class="outline-text-2" id="text-org31205e9">
<p>
This is an illutstratoin of the central limit theorem.
</p>

<p>
A) Generate a vector of length 10000, with real numbers between \(0\) to \(10\)
uniformly distributed, and Plot a (frequency) histogram.
</p>

<p>
B) Take a sample of size \(n=5\) of your vector and compute the artihmetic mean (average), store the result in 
another variable. Repeat the experiment 3000 times and make a histogram of the means obtained.
</p>

<p>
C) Is this in accordnce with the Central Limit Theorem?
</p>
</div>
</div>





<div id="outline-container-org10f6adc" class="outline-2">
<h2 id="org10f6adc">Practice 4</h2>
<div class="outline-text-2" id="text-org10f6adc">
<p>
The ancient game of craps consists on throwing two dice and add the
scores together. There are 11 possible scores from a minimum of 2 to a
maximum of 12. The most likely score is 7 because there are six ways
that this could come about.
</p>

<p>
A) Create Two vectors (A and B) of length 10000 with numbers \(1,2,3,4,5,6\)
choosen randomly each one simulating the results of throwing a dice
ten thousand times. (Hint. This can be done modifying <code>runif</code> or with
the function <code>sample</code>)
</p>

<p>
B) Plot the histogram of one dice. Plot the histogram of the sum of who
dice \(A + B\). Comment the results obtained.
</p>

<p>
C) What is the most likely value in the crab game with 4 dice?
</p>
</div>
</div>



<div id="outline-container-org65b5e16" class="outline-2">
<h2 id="org65b5e16">Practice 5</h2>
<div class="outline-text-2" id="text-org65b5e16">
<p>
Recall that The Binomial distribution computes the probabilities of
events where only two possible outcomes can occur (success or
failure). Suppose then that \(X \sim \mbox{Binom}(n,p)\) then
if \(f\) denotes the probaility density function we can write:
</p>

\begin{equation}
f(k) = P(X = k) = \binom{n}{k}  p^{k}(1-p)^{n-k}.
\end{equation}

<p>
This reads as follows: The probaility of obtaining (exactly) \(k\) successful 
events out of \(n\) trials each of them of probability \(p\) is \(f(k)\).
</p>

<p>
A) Let fix the value \(p = 0.15\). Make a gird (2x2) plot (see <code>par</code> and
<code>mfrow</code>) of the binomial density function for \(n = 5\),  \(n = 10\), \(n = 20\) and
\(n=300\). (Hint. For descrete distrubutions, the plot looks nicer with
the option <code>type = "h"</code>)
</p>

<p>
B) Plot the distribution for  \(X \sim \mbox{Binom}(300, 0.15)\) and
\(Z \sim N(\mu, \sigma^2)\) (in the same plot window) where
</p>
\begin{equation}
\mu = E(X) , \qquad \sigma^2 = \mbox{Var}(X)
\end{equation}
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Ballesteros Chávez.</p>
<p class="date">Created: 2022-11-12 Sat 17:02</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
